package com.pb.leonov.hw3;

//2. Создайте класс Array в пакете hw3.
//        Программа должна позволить пользователю ввести одномерный массив целых чисел размерностью 10 элементов.
//        Вывести на экран введенный массив.
//        Подсчитать сумму всех элементов массива и вывести ее на экран.
//        Подсчитать и вывести на экран количество положительных элементов.
//        Произвести сортировку этого массива от меньшего к большему по алгоритму сортировки пузырьком. (https://en.wikipedia.org/wiki/Bubble_sort)
//        Вывести на экран отсортированный массив.

public class Array {
    public static void main(String[] args) {


    }

}
